{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing...\n",
      "1.3  ms elapsed time\n",
      "-----------------\n"
     ]
    }
   ],
   "source": [
    "#STEP 1 : Generate fake data using GraphAware graphgen\n",
    "# https://github.com/graphaware/neo4j-graphgen-procedure\n",
    "# you will need to compile the graphgen .jar file and add it to Neo4j/plugins and restart Neo4j\n",
    "# (tip: update to JDK 8)\n",
    "\n",
    "#!pip install neo4j-driver\n",
    "\n",
    "import time\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "\n",
    "generate1 = '''\n",
    "CALL generate.nodes('Individual', '{firstName: firstName, lastName: lastName}', 100) YIELD nodes as i\n",
    "FOREACH (n IN i |\n",
    "CREATE (l:Lead) \n",
    "SET l.timestamp = 0, l.dispLabel = \"Lead\" \n",
    "MERGE (n)-[c:CONVERTED_TO]->(l))\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "generate2 = '''\n",
    "CALL generate.nodes('Individual', '{firstName: firstName, lastName: lastName}', 100) YIELD nodes as i2\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "generate3 = '''\n",
    "MATCH (n:Individual) WITH COLLECT(n) AS i\n",
    "CALL generate.nodes('Activity', '{activityId: randomNumber}', 25) YIELD nodes as a\n",
    "CALL generate.relationships(a,i, 'TOUCHED', '{timestamp: unixTime}', 25, '25-50') YIELD relationships as rel2\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "generate4 = '''\n",
    "MATCH (a:Activity)-[:TOUCHED]->(i:Individual)\n",
    "SET i.dispLabel = \"Indiv\"\n",
    "SET a.dispLabel = \"Activity\"\n",
    ";\n",
    "'''\n",
    "\n",
    "session = driver.session()\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "session.run(generate1)\n",
    "session.run(generate2)\n",
    "session.run(generate3)\n",
    "session.run(generate4)\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "session.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing...\n",
      "1.8  ms elapsed time\n",
      "-----------------\n"
     ]
    }
   ],
   "source": [
    "import time\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "model1 = '''\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i, count(*) AS touches, collect(t.timestamp) AS touchColl\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = touchSeq[touches-1]\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'lastTouch', attributionTouchTime: touchSeq[touches-1], attributionTouchSeq: touches, attributionTimeSeq: 1, attributionWeight: 1.0, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "model2 = '''\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i, count(*) AS touches, collect(t.timestamp) AS touchColl, RANGE(count(*), 1, -1) AS sequence\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = touchSeq[0]\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'firstTouch', attributionTouchTime: touchSeq[0], attributionTouchSeq: 1, attributionTimeSeq: touches, attributionWeight: 1.0, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "model3 = '''\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i, count(*) AS touches, collect(t.timestamp) AS touchColl, RANGE(count(*), 1, -1) AS sequence\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "UNWIND sequence AS seq\n",
    "WITH i, touches, touchSeq[touches-seq] AS ts, seq, 1/toFloat(touches) AS even_touch_wt\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = ts\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'evenTouch', attributionTouchTime: ts, attributionTouchSeq: (touches-seq+1), attributionTimeSeq: seq, attributionWeight: even_touch_wt, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "model4 = '''\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i,count(*) AS touches, COLLECT(t.timestamp) AS touchColl,  RANGE(count(*), 1, -1) AS sequence\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "UNWIND sequence AS seq\n",
    "WITH i, touches, touchSeq[touches-seq] AS ts, seq,\n",
    "CASE touches WHEN 1 THEN 1 ELSE EXP(seq*-0.7) END AS exp_decay_wt\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = ts\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'expDecay', attributionTouchTime: ts, attributionTouchSeq: (touches-seq+1),  attributionTimeSeq: seq, attributionWeight: exp_decay_wt, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "session = driver.session()\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "session.run(model1)\n",
    "session.run(model2)\n",
    "session.run(model3)\n",
    "session.run(model4)\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "session.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing...\n",
      "0.8  ms elapsed time\n",
      "-----------------\n"
     ]
    }
   ],
   "source": [
    "#STEP 3 : Compute binary cosine similarity\n",
    "# I'm using the OTU syntax so that you can try other similarity measures\n",
    "# http://www.iiisci.org/journal/CV$/sci/pdfs/GS315JG.pdf\n",
    "#\n",
    "# a/SQRT((a+b)*(a+c)) AS cosineSimilarity,\n",
    "# a/(a+b+c) AS jaccardSimilarity,\n",
    "# (2*a)/((2*a)+b+c) AS diceSimilarity,\n",
    "# SQRT(b+c) AS euclideanDistance,\n",
    "# (b+c) AS manhattanDistance,\n",
    "# (b+c) AS minkowskiDistance,\n",
    "# (a+d)/(a+b+c+d) AS sokalMichenerSimilarity,\n",
    "# (a+(0.5*d))/(a+b+c+d) AS faithSimilarity,\n",
    "# ABS((a*(c+d))/(c*(a+b))) AS ampleSimilarity\n",
    "\n",
    "\n",
    "#!pip install neo4j-driver\n",
    "\n",
    "import time\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "query1 = '''\n",
    "// in OTU\n",
    "MATCH (:Activity)\n",
    "WITH COUNT(*) AS vcnt\n",
    "MATCH (i1:Individual)<-[:TOUCHED]-(ax:Activity)-[:TOUCHED]->(i2:Individual)\n",
    "WITH vcnt,i1,i2, COLLECT(ax.activityId) AS v1xv2\n",
    "MATCH (i1)<-[:TOUCHED]-(a1:Activity:TestData)\n",
    "WITH vcnt,i1,i2,v1xv2, COLLECT(a1.activityId) AS v1\n",
    "MATCH (i2)<-[:TOUCHED]-(a2:Activity:TestData)\n",
    "WITH vcnt,i1,i2,v1xv2,v1,COLLECT(a2.activityId) AS v2\n",
    "WITH vcnt,i1,i2,v1xv2,v1,v2,\n",
    "toFloat(SIZE(v1xv2)) AS a, //i • j  (i and j present: 1,1)\n",
    "toFloat(SIZE(v2)-SIZE(v1xv2)) AS b, // conjugate i • j (i absent, j present : 0,1)\n",
    "toFloat(SIZE(v1)-SIZE(v1xv2)) AS c, // i • conjugate j (i present, j absent: 1,0)\n",
    "toFloat(vcnt-SIZE(v1)-SIZE(v2)) AS d // conjugate i • conjugate j (i and j absent: 0,0)\n",
    "MERGE (i1)-[s:SIMILARITY]-(i2)\n",
    "SET s.similarity = a/SQRT((a+b)*(a+c)) // cosine similarity\n",
    "'''\n",
    "\n",
    "session = driver.session()\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "session.run(query1)\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "session.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python [Root]",
   "language": "python",
   "name": "Python [Root]"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
