{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing...\n",
      "0.3  ms elapsed time\n",
      "-----------------\n",
      "\n",
      "MATCH (n) DETACH DELETE n\n",
      "\n",
      "[]\n",
      "{'relationships_deleted': 3658, 'nodes_deleted': 175}\n"
     ]
    }
   ],
   "source": [
    "import time\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "\n",
    "detachDelete = '''\n",
    "MATCH (n) DETACH DELETE n\n",
    "'''\n",
    "\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "result = session.run(detachDelete)\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "\n",
    "\n",
    "summary = result.consume()\n",
    "\n",
    "for record in result:\n",
    "    print(record) \n",
    "    \n",
    "print(summary.statement)\n",
    "print(summary.notifications)\n",
    "print(summary.counters)\n",
    "session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing...\n",
      "1.5  ms elapsed time\n",
      "-----------------\n",
      "\n",
      "MATCH (i:Individual)\n",
      "SET i.dispLabel = \"Indiv\"\n",
      "RETURN *\n",
      ";\n",
      "\n",
      "[]\n",
      "{'properties_set': 100}\n"
     ]
    }
   ],
   "source": [
    "#STEP 1 : Generate fake data using GraphAware graphgen\n",
    "# https://github.com/graphaware/neo4j-graphgen-procedure\n",
    "# you will need to compile the graphgen .jar file and add it to Neo4j/plugins and restart Neo4j\n",
    "# (tip: update to JDK 8)\n",
    "\n",
    "#!pip install neo4j-driver\n",
    "\n",
    "import time\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "\n",
    "detachDelete = '''\n",
    "MATCH (n) DETACH DELETE n\n",
    "'''\n",
    "\n",
    "\n",
    "generate1 = '''\n",
    "CALL generate.nodes('Individual', '{firstName: firstName, lastName: lastName}', 50) YIELD nodes as i\n",
    "FOREACH (n IN i |\n",
    "CREATE (l:Lead) \n",
    "SET l.timestamp = 0, l.dispLabel = \"Lead\" \n",
    "MERGE (n)-[c:CONVERTED_TO]->(l))\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "generate2 = '''\n",
    "CALL generate.nodes('Individual', '{firstName: firstName, lastName: lastName}', 50) YIELD nodes as i2\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "generate3 = '''\n",
    "MATCH (n:Individual) WITH COLLECT(n) AS i\n",
    "CALL generate.nodes('Activity', '{activityId: randomNumber}', 25) YIELD nodes as a\n",
    "CALL generate.relationships(a,i, 'TOUCHED', '{timestamp: unixTime}', 25, '5-30') YIELD relationships as rel2\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "generate4 = '''\n",
    "MATCH (a:Activity)\n",
    "SET a.dispLabel = \"Activity\"\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "generate5 = '''\n",
    "MATCH (i:Individual)\n",
    "SET i.dispLabel = \"Indiv\"\n",
    "RETURN *\n",
    ";\n",
    "'''\n",
    "\n",
    "session = driver.session()\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "session.run(generate1)\n",
    "session.run(generate2)\n",
    "session.run(generate3)\n",
    "session.run(generate4)\n",
    "result = session.run(generate5)\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "summary = result.consume()    \n",
    "print(summary.statement)\n",
    "print(summary.notifications)\n",
    "print(summary.counters)\n",
    "session.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing...\n"
     ]
    },
    {
     "ename": "NameError",
     "evalue": "name 'model' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-47-63fc38ae785c>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     67\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmodel2\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     68\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmodel3\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 69\u001b[0;31m \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmodel\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     70\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mround\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtime\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtime\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m-\u001b[0m \u001b[0mt0\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0;36m1000\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\" ms elapsed time\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     71\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'-----------------'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'model' is not defined"
     ]
    }
   ],
   "source": [
    "#STEP 2 : Compute lead attribution models\n",
    "\n",
    "#!pip install neo4j-driverimport time\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "model1 = '''\n",
    "//lastTouch\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i, count(*) AS touches, collect(t.timestamp) AS touchColl\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = touchSeq[touches-1]\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'lastTouch', attributionTouchTime: touchSeq[touches-1], attributionTouchSeq: touches, attributionTimeSeq: 1, attributionWeight: 1.0, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "model2 = '''\n",
    "//firstTouch\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i, count(*) AS touches, collect(t.timestamp) AS touchColl, RANGE(count(*), 1, -1) AS sequence\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = touchSeq[0]\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'firstTouch', attributionTouchTime: touchSeq[0], attributionTouchSeq: 1, attributionTimeSeq: touches, attributionWeight: 1.0, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "model3 = '''\n",
    "//linearTouch\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i, count(*) AS touches, collect(t.timestamp) AS touchColl, RANGE(count(*), 1, -1) AS sequence\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "UNWIND sequence AS seq\n",
    "WITH i, touches, touchSeq[touches-seq] AS ts, seq, 1/toFloat(touches) AS linear_touch_wt\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = ts\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'linearTouch', attributionTouchTime: ts, attributionTouchSeq: (touches-seq+1), attributionTimeSeq: seq, attributionWeight: linear_touch_wt, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "model4 = '''\n",
    "//expDecay\n",
    "MATCH (:Activity)-[t:TOUCHED]->(i:Individual)-[:CONVERTED_TO]->(:Lead)\n",
    "WITH i,count(*) AS touches, COLLECT(t.timestamp) AS touchColl,  RANGE(count(*), 1, -1) AS sequence\n",
    "CALL apoc.coll.sort(touchColl) YIELD value AS touchSeq\n",
    "UNWIND sequence AS seq\n",
    "WITH i, touches, touchSeq[touches-seq] AS ts, seq,\n",
    "CASE touches WHEN 1 THEN 1 ELSE EXP(seq*-0.7) END AS exp_decay_wt\n",
    "MATCH (a:Activity)-[t:TOUCHED]->(i:Individual)-[c:CONVERTED_TO]->(l:Lead)\n",
    "WHERE t.timestamp = ts\n",
    "MERGE (l)-[m:ATTRIBUTED_TO {attributionModel:'expDecay', attributionTouchTime: ts, attributionTouchSeq: (touches-seq+1),  attributionTimeSeq: seq, attributionWeight: exp_decay_wt, attributionTouches: touches}]->(a)\n",
    ";\n",
    "'''\n",
    "\n",
    "session = driver.session()\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "result = session.run(model1)\n",
    "session.run(model2)\n",
    "session.run(model3)\n",
    "session.run(model4)\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "summary = result.consume()    \n",
    "print(summary.statement)\n",
    "print(summary.notifications)\n",
    "print(summary.counters)\n",
    "session.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "#STEP 3 : Compute binary cosine similarity\n",
    "# I'm using the OTU syntax so that you can try other similarity measures\n",
    "# http://www.iiisci.org/journal/CV$/sci/pdfs/GS315JG.pdf\n",
    "\n",
    "#!pip install neo4j-driver\n",
    "\n",
    "import time\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "sim1 = '''\n",
    "MATCH (:Activity)\n",
    "WITH COUNT(*) AS vcnt\n",
    "MATCH (i1:Individual)<-[:TOUCHED]-(ax:Activity)-[:TOUCHED]->(i2:Individual)\n",
    "WITH vcnt,i1,i2, COLLECT(ax.activityId) AS v1xv2\n",
    "MATCH (i1)<-[:TOUCHED]-(a1:Activity)\n",
    "WITH vcnt,i1,i2,v1xv2, COLLECT(a1.activityId) AS v1\n",
    "MATCH (i2)<-[:TOUCHED]-(a2:Activity)\n",
    "WITH vcnt,i1,i2,v1xv2,v1,COLLECT(a2.activityId) AS v2\n",
    "WITH vcnt,i1,i2,v1xv2,v1,v2,\n",
    "toFloat(SIZE(v1xv2)) AS a, //a = i • j  (i and j present: 1,1)\n",
    "toFloat(SIZE(v2)-SIZE(v1xv2)) AS b, // b = i̅ • j (i absent, j present : 0,1)\n",
    "toFloat(SIZE(v1)-SIZE(v1xv2)) AS c, // c = i • j̅ (i present, j absent: 1,0)\n",
    "toFloat(vcnt-SIZE(v1)-SIZE(v2)) AS d // d = i̅ • j̅ (i and j absent: 0,0)\n",
    "MERGE (i1)-[s:SIMILARITY]-(i2)\n",
    "SET s.similarity = a/SQRT((a+b)*(a+c)), s.measure = 'cosine' // cosine similarity\n",
    "//SET s.similarity = a/(a+b+c), s.measure = 'jaccard' // jaccard similarity\n",
    "//SET s.similarity = (2*a)/((2*a)+b+c), s.measure = 'dice' // dice similarity\n",
    "//SET s.similarity = SQRT(b+c), s.measure = 'euclidean' // euclidean distance\n",
    "//SET s.similarity = (b+c), s.measure = 'manhattan' // manhattan distance\n",
    "//SET s.similarity = (a+d)/(a+b+c+d), s.measure = 'sokal-michener' // sokal-michener similarity\n",
    "//SET s.similarity = (a+(0.5*d))/(a+b+c+d), s.measure = 'faith' // faith similarity\n",
    "//SET s.similarity = ABS((a*(c+d))/(c*(a+b))), s.measure = 'ample' // ample similarity\n",
    "'''\n",
    "\n",
    "session = driver.session()\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "result = session.run(sim1)\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "summary = result.consume()    \n",
    "print(summary.statement)\n",
    "print(summary.notifications)\n",
    "print(summary.counters)\n",
    "session.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "#STEP 4 : Compute recommendations, using nearest neighbors to pick activity based on marketing attribution model \n",
    "\n",
    "#!pip install neo4j-driver\n",
    "\n",
    "import time\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "from IPython.display import display, HTML\n",
    "\n",
    "from neo4j.v1 import GraphDatabase, basic_auth, TRUST_ON_FIRST_USE, CypherError\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\",\n",
    "                              auth=basic_auth(\"neo4j\", \"neo4j\"),\n",
    "                              encrypted=False,\n",
    "                              trust=TRUST_ON_FIRST_USE)\n",
    "\n",
    "session = driver.session()\n",
    "\n",
    "reco1 = '''\n",
    "MATCH (a1:Activity)-[:TOUCHED]->(i1:Individual)-[s:SIMILARITY]->(n1:Individual)-[c:CONVERTED_TO]->(l:Lead)-[:ATTRIBUTED_TO {attributionModel: 'lastTouch'}]->(a2:Activity)\n",
    "WHERE NOT ((i1)-[:CONVERTED_TO]->(:Lead)) AND a1 <> a2\n",
    "WITH i1, s.measure AS msr, s.similarity AS sim, a2.activityId AS acts\n",
    "ORDER BY id(i1) ASC, sim DESC\n",
    "//sample 10 nearest neighbors with highest similarity\n",
    "WITH i1, msr, COLLECT([acts,sim])[0..10] AS nn \n",
    "UNWIND nn AS top_nn\n",
    "WITH i1, msr, top_nn[0] AS av, ROUND(avg(top_nn[1])*1000)/1000 AS avg_s, count(top_nn[1]) AS cnt_nn\n",
    "ORDER BY id(i1) ASC, avg_s DESC, cnt_nn DESC\n",
    "//RETURN i1.firstName as target, COLLECT([{activityId:av},{avgSimilarity:avg_s},{countNeighbors:cnt_nn}]) AS reco\n",
    "RETURN id(i1) AS targetId, i1.firstName AS firstName, i1.lastName AS lastName, av AS activityId, avg_s AS avgSimilarity, cnt_nn AS countNeighbors , msr AS simMeasure\n",
    "'''\n",
    "\n",
    "session = driver.session()\n",
    "t0 = time.time()\n",
    "print(\"processing...\")\n",
    "result = session.run(reco1)\n",
    "print()\n",
    "print(round((time.time() - t0)*1000,1), \" ms elapsed time\")\n",
    "print('-----------------')\n",
    "session.close()\n",
    "\n",
    "print()\n",
    "print(\"Marketing Activity Recommendations:\")\n",
    "print(\"k-NN using Binary Cosine Similarity and Last Touch Attribution\")\n",
    "print()\n",
    "print(\"(Recommended next marketing activity for an unconverted individual based on\")\n",
    "print(\"nearest converted neighbors with a similar history of marketing touches\")\n",
    "print(\"and where conversion to lead is attributed to the last marketing touch.)\")\n",
    "print()\n",
    "\n",
    "df = pd.DataFrame(list([r.values() for r in result]),\n",
    "                      columns=['nodeId (target)','firstName','lastName', 'activityId (reco)', 'avgSimilarity', 'countNeighbors','simMeasure'])\n",
    "#print(df)\n",
    "\n",
    "#display(df)\n",
    "\n",
    "df.style\\\n",
    "    .bar(subset=['avgSimilarity'], color='#ff9500')\\\n",
    "    .bar(subset=['countNeighbors'], color='#efefef')\\\n",
    "    \n",
    "   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python [Root]",
   "language": "python",
   "name": "Python [Root]"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
